Repository: shivamkumar2687/InternDisha-SiH-2025
Catalog: InternDisha/*.lproj/Localizable.strings
Languages: ta

source: Profile
ta: சுயவிவரம்

source: Internship
ta: இண்டர்ன்ஷிப்

source: My Internship
ta: என் இண்டர்ன்ஷிப்

source: Apply
ta: விண்ணப்பிக்கவும்

source: About
ta: பற்றி

source: Predict Chance
ta: பொருந்தல் சாத்தியம்

source: Match Score
ta: பொருந்தல் மதிப்பெண்

source: Language
ta: மொழி

source: App Language
ta: அப் மொழி

source: Personal Information
ta: தனிப்பட்ட தகவல்

source: Name
ta: பெயர்

source: Date of Birth
ta: பிறந்த தேதி

source: Mobile
ta: மொபைல்

source: Email
ta: மின்னஞ்சல்

source: Qualification
ta: தகுதி

source: Skills
ta: திறன்கள்

source: No skills selected
ta: திறன்கள் தேர்ந்தெடுக்கப்படவில்லை

source: Interests
ta: ஆர்வங்கள்

source: No interests selected
ta: ஆர்வங்கள் தேர்ந்தெடுக்கப்படவில்லை

source: Location Preferences
ta: இட விருப்பங்கள்

source: No locations selected
ta: இடங்கள் தேர்ந்தெடுக்கப்படவில்லை

source: Logout
ta: வெளியேறு

source: Edit
ta: திருத்து

source: Not logged in
ta: உள்நுழைவு செய்யப்படவில்லை

source: Please sign in to view your profile.
ta: உங்கள் சுயவிவரத்தை பார்க்க உள்நுழையவும்.

source: Sign in and set up your profile to see your match score.
ta: உள்நுழைந்து உங்கள் சுயவிவரத்தை அமைக்கவும், பொருந்தல் மதிப்பெண் காண.

source: Welcome Back
ta: மீண்டும் வரவேற்கிறோம்

source: Sign in to your account
ta: உங்கள் கணக்கில் உள்நுழைக

source: Enter your email
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்

source: Password
ta: கடவுச்சொல்

source: Enter your password
ta: கடவுச்சொல்லை உள்ளிடவும்

source: Sign In
ta: உள்நுழை

source: Don't have an account?
ta: உங்களிடம் கணக்கு இல்லையா?

source: Sign Up
ta: பதிவு செய்யவும்

source: Create Account
ta: கணக்கு உருவாக்கவும்

source: Join InternDisha and start your journey
ta: InternDisha-வில் இணைந்து உங்கள் பயணத்தை தொடங்குங்கள்

source: Step %d of %d
ta: %d படிகளில் %d

source: Back
ta: பின்

source: Next
ta: அடுத்து

source: Already have an account?
ta: ஏற்கனவே கணக்கு உள்ளதா?

source: View Mode
ta: காணும் முறை

source: Recommended
ta: பரிந்துரைகள்

source: Overall
ta: மொத்தம்

source: Filter
ta: வடிகட்டி

source: Hello, %@
ta: வணக்கம், %@

source: Hello
ta: வணக்கம்

source: 12th
ta: 12ஆம் வகுப்பு

source: Bachelors
ta: இளங்கலை

source: Masters
ta: முதுகலை

source: Search internships…
ta: இண்டர்ன்ஷிப்புகளை தேடு…

source: Internship ID
ta: இண்டர்ன்ஷிப் ஐடி

source: Internship Title
ta: இண்டர்ன்ஷிப் தலைப்பு

source: Minimum Qualification
ta: குறைந்தபட்ச தகுதி

source: Number of Openings
ta: காலியிடங்கள் எண்ணிக்கை

source: Area/Field
ta: பகுதி/துறை

source: Skill
ta: திறன்

source: more skills
ta: மேலும் திறன்கள்
